In [1]:
import pandas as pd

In [12]:
food=["itly","dhosa","poori","vada","pongal"]
price=[20,25,40,15,30]
offer_price=[15,20,30,10,35]

In [13]:
data=pd.DataFrame({"food":food,"Price":price,"Offer_price":offer_price})

In [14]:
data

     food  Price  Offer_price
0    itly     20           15
1   dhosa     25           20
2   poori     40           30
3    vada     15           10
4  pongal     30           35

In [15]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   food         5 non-null      object
 1   Price        5 non-null      int64
 2   Offer_price  5 non-null      int64
dtypes: int64(2), object(1)
memory usage: 252.0+ bytes

In [16]:
data.food

0      itly
1     dhosa
2     poori
3      vada
4    pongal
Name: food, dtype: object

In [19]:
data["Offer_price"]

0    15
1    20
2    30
3    10
4    35
Name: Offer_price, dtype: int64

In [22]:
data.to_csv("menu.csv",index=False)

In [2]:
customer=["tvs","maruthi","royal","moter","tata",]
products=["bike","car","lori","bike","car"]
price=[10000,150000,80000,50000,160000]

In [3]:
data=pd.DataFrame({"customer":customer,"products":products,"price":price})

In [5]:
data

  customer products   price
0      tvs     bike   10000
1  maruthi      car  150000
2    royal     lori   80000
3    moter     bike   50000
4     tata      car  160000

In [7]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   customer  5 non-null      object
 1   products  5 non-null      object
 2   price     5 non-null      int64
dtypes: int64(1), object(2)
memory usage: 252.0+ bytes

In [9]:
data.customer

0        tvs
1    maruthi
2      royal
3      moter
4       tata
Name: customer, dtype: object